app/controllers/mini_pagos_controller.rb

  def index
    @mini_pagos = MiniPago.all
---
SELECT "mini_pagos".* FROM "mini_pagos"

  def show
    @mini_pago = MiniPago.find(params[:id])
---
SELECT "mini_pagos".* FROM "mini_pagos" WHERE "mini_pagos"."id" = $1 LIMIT 1  [["id", "1"]]

  def create
    @mini_pago = MiniPago.new(params[:mini_pago])

    respond_to do |format|
      if @mini_pago.save
---
INSERT INTO "mini_pagos" ("created_at", "dni", "fecha_pago", "folio", "id_pago", "monto", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"